[
  {
    "id": "1",
    "name": "The OpenxAI Genesis",
    "description": "## Overview\n\nThe OpenxAI Genesis marks the official launch of the OpenxAI initiative, establishing the foundation for protocol development, governance, and ecosystem integration. This milestone includes the deployment of OpenxAI Studio, seamless aggregation and integration of open-source AI models, and the implementation of Xnode and bare-metal infrastructure to power decentralized AI computation. Additionally, it involves the creation of Genesis user dashboards, the activation of OpenxAIDAO for decentralized governance, and the setup of funding mechanisms, incentive structures, and community engagement strategies. The deployment of initial smart contracts ensures transparency, security, and automation in the network's operations, solidifying OpenxAI as a fully decentralized AI ecosystem.\n\n## Scope of Work\n- Deployment of the OpenxAI fundraising smart contract, enabling milestone-based funding and automated disbursements.\n- Setup and auditing of wallet infrastructure, ensuring secure fund allocations and efficient financial operations.\n- Deployment of OpenxAI Studio, providing an intuitive interface for AI model execution, compute resource management, and analytics.\n- Integration of open-source AI models, allowing developers to access and contribute to decentralized AI solutions.\n- Development of a public-facing dashboard, displaying real-time fund allocations, infrastructure health, and milestone progress.\n- Activation of OpenxAI DAO (OpexAIDAO) for decentralized governance, ensuring transparent decision-making.\n- Establishment of funding mechanisms, incentive structures, and community engagement strategies to drive ecosystem participation.\n- By integrating Xnode, Xnode Studio, and bare-metal compute infrastructure, OpenxAI will provide a scalable, secure, and decentralized AI environment, enabling contributors to develop, deploy, and monetize AI models with full transparency and governance oversight.",
    "fundingGoal": "15000",
    "deadline": "2025-03-10",
    "backersRewards": "550030",
    "flashBonus": "120000",
    "rewardAPY": "76.50",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "2",
    "name": "OpenxAI Decentralized Infrastructure Fund (Q1)",
    "description": "## Overview\n\nThe OpenxAI Decentralized Infrastructure Fund, powered by Openmesh Xnode, establishes the core infrastructure for decentralized AI compute, storage, and networking. Xnode, a decentralized virtual machine similar to AWS EC2, eliminates reliance on centralized cloud providers by leveraging Openmesh's bare-metal and cloud-independent architecture. This ensures permissionless, scalable, and distributed computing, allowing AI models to execute seamlessly across a global network of independent nodes. AI without censorship. Your AI. Your Rules. No Middlemen.\n\nXnode dynamically provisions compute resources, optimizes workload distribution, and ensures high availability for AI developers and researchers. Unlike traditional cloud-based AI execution, it provides censorship-resistant, cost-efficient, and fully decentralized AI computation, making OpenxAI independent from corporate cloud monopolies.\n\nDeploying and maintaining this infrastructure requires compute node deployment, network load balancing, security hardening, and AI model execution automation to ensure reliability and scalability.\n\n## Scope of Work\n- Aggregate the most powerful open source AI models and integrate into OpenxAI Studio.\n- Deploy and configure Xnode-powered compute clusters across Openmesh's decentralized infrastructure to support AI data sets and model training workloads.\n- Set up decentralized storage infrastructure to facilitate AI data availability, ensuring that datasets and model artifacts are distributed securely and redundantly across the network.\n- Develop and integrate automated resource allocation algorithms to optimize compute scheduling and efficiently allocate workloads based on demand and node availability.\n- Implement security protocols and failover mechanisms to prevent data loss, secure model execution, and maintain 99.9% uptime across AI workloads.\n- Conduct performance benchmarking and stress testing to validate system stability, ensuring OpenxAI can support high-intensity AI computations in real-world scenarios.\n- Optimize GPU-based AI execution pipelines for decentralized environments, enabling seamless data processing and AI model training across Openmesh's compute network.",
    "fundingGoal": "30000",
    "deadline": "2025-03-15",
    "backersRewards": "1087678",
    "flashBonus": "240000",
    "rewardAPY": "70.30",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "3",
    "name": "Milestone Based Fair Launch on Uniswap & Liquidity Setup",
    "description": "## Overview\n\nMilestone-Based Fair Launch, TGE & Uniswap Setup is a structured token distribution model similar to Kickstarter, ensuring that funds are allocated transparently and responsibly based on achievable project milestones rather than speculative hype. Unlike traditional token launches (ICOs, IDOs, INOs) where funds are raised upfront without accountability, this methodology ties funding releases directly to project progress through smart contracts, verified by the community, ensuring that funds are escrowed using smart contracts and deployed only when milestones are met.\n\n$20,000 worth of USDC, USDT, or WETH will be allocated to deploy Uniswap liquidity pools and configure trading parameters.\n\n## Basics\n- Funds are locked in smart contracts and released only when predefined milestones are met.\n- Each milestone is publicly listed with clear objectives and funding details.\n- Funds are publicly tracked and verified, ensuring full transparency.\n- Backers use ETH, USDC, USDT, or WETH and can only claim their OPENX tokens when a milestone is confirmed.\n- Risk Mitigation for Backers – If a milestone fails, funds are refunded, with 1 OPENX per $1 contributed as an appreciation bonus.\n\n## Scope of Work\n- Deploy Uniswap liquidity pools and configure trading parameters.\n- Implement smart contract mechanisms to enforce milestone-based fund releases.\n- Develop a real-time fundraising dashboard for tracking milestone progress and fund disbursement.\n- Enforce tiered funding limits to prevent concentration of token ownership.\n- Establish secure token claim mechanisms to ensure rewards are distributed only upon milestone completion.\n- Conduct smart contract security audits to prevent vulnerabilities and ensure fair execution.",
    "fundingGoal": "20000",
    "deadline": "2025-03-14",
    "backersRewards": "716862",
    "flashBonus": "160000",
    "rewardAPY": "64.52",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "4",
    "name": "Launch OpenxAIDAO & Governance",
    "description": "## Overview\n\nA Decentralized Autonomous Organization (DAO) is a self-governing system where decisions are made collectively by its members rather than a central authority. DAOs leverage smart contracts to automate governance, execute treasury management, and enforce transparent decision-making processes. OpenxAIDAO is the core governance entity of OpenxAI, responsible for managing funding allocations, setting development priorities, and overseeing ecosystem expansion.\n\nOpenxAIDAO is built using AragonDAO modules, customized by the Openmesh team to fit the specific needs of OpenxAI. This integration provides a robust and scalable governance infrastructure, enabling efficient proposal execution, decentralized treasury management, and seamless community participation.\n\n## Core Purpose\n- Power is distributed among token holders, preventing centralized control\n- Treasury allocations are governed by community-approved smart contracts\n- Members propose, vote on, and fund initiatives that align with ecosystem growth\n- Smart contracts execute governance decisions without intermediaries\n- Governance mechanisms include veto rights and structured proposal evaluation\n\n## How It Works\n- Token holders and Verified Contributor NFT holders can propose funding allocations and initiatives\n- Quadratic Voting & Veto System ensures balanced decision-making power\n- Treasury-Controlled Smart Contracts release funds only when milestones are met\n- Transparent interface for proposal tracking and voting history\n- Structured governance process for dispute resolution\n\n## Scope of Work\n- Deploy OpenxAIDAO smart contracts for governance operations\n- Implement quadratic voting and veto mechanisms\n- Integrate OpenxAIDAO modules into user dashboard\n- Develop real-time governance tracking dashboard\n- Integrate multi-signature security for treasury management\n- Conduct security audits on governance contracts\n- Establish community onboarding framework",
    "fundingGoal": "5000",
    "deadline": "2025-03-10",
    "backersRewards": "177151",
    "flashBonus": "40000",
    "rewardAPY": "59.11",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "5",
    "name": "Community Bounties",
    "description": "## Overview\n\nIncentivizes early adopters, developers, and community members by rewarding contributions to OpenxAI. Tasks include technical development, content creation, outreach, and enhancing community resources.\n\nParticipants will have the opportunity to collaborate on key OpenxAI initiatives, contributing to community growth, refining engagement strategies, expanding educational resources, and increasing global awareness. Rewards will be distributed based on impact, quality, and successful task completion.\n\n## Scope of Work\n- Establish a bounty system covering technical and non-technical contributions\n- Launch five bounty categories with structured rewards\n- Set up submission and verification processes for bounty claims",
    "fundingGoal": "5000",
    "deadline": "2025-03-31",
    "backersRewards": "175087",
    "flashBonus": "40000",
    "rewardAPY": "54.05",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "6",
    "name": "Protocol Operations (March)",
    "description": "## Overview\n\nThe core team has already spent over $18,000 this month to launch the project. These funds will cover the remaining essential operational expenses for OpenxAI in March, ensuring the continuity of infrastructure, community initiatives, and ecosystem engagement.\n\n## Scope of Work\n- Maintain core operations for uninterrupted infrastructure and development\n- Support community-driven initiatives and engagement programs\n- Collaborate with key stakeholders to drive adoption and integration\n- Ensure infrastructure stability and network uptime\n- Provide essential services availability for users and contributors",
    "fundingGoal": "8000",
    "deadline": "2025-03-31",
    "backersRewards": "276837",
    "flashBonus": "64000",
    "rewardAPY": "49.31",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "7",
    "name": "100 Videos, 100 Articles, 10 Days",
    "description": "## Overview\n\nA large-scale content initiative aimed at educating, onboarding, and increasing awareness of OpenxAI across Web3, AI, and developer communities. The campaign will produce technical guides, benchmark testing, thought leadership articles, explainer videos, tutorials, deep-dive research papers, case studies, social media content, and community AMAs.\n\n## Scope of Work\n- Publish 100 high-quality articles covering OpenxAI's ecosystem\n- Produce 100 engaging videos including technical walkthroughs\n- Create comprehensive benchmark reports\n- Develop detailed tutorials and developer guides\n- Publish deep-dive research papers and case studies\n- Design infographics and visual content\n- Host community-driven discussions and AMAs\n- Implement structured content distribution strategy",
    "fundingGoal": "25000",
    "deadline": "2025-03-10",
    "backersRewards": "854798",
    "flashBonus": "200000",
    "rewardAPY": "44.84",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "8",
    "name": "Community Ambassador Program",
    "description": "## Overview\n\nAmbassadors play a vital role in raising awareness, driving adoption, and supporting new community members. The OpenxAI Ambassador Program is designed to attract passionate and talented individuals who align with OpenxAI's vision. Selected ambassadors will gain exclusive access to OpenxAI resources, early product updates, and priority participation in governance.\n\n## Scope of Work\n- Onboard 15–20 ambassadors with proven track records\n- Develop structured engagement strategy with tiered incentives\n- Provide educational resources and community tools\n- Host monthly community calls and AMAs\n- Organize localized meetups and hackathons\n- Implement performance tracking mechanisms\n- Facilitate cross-community collaborations\n- Reward top-performing ambassadors",
    "fundingGoal": "5000",
    "deadline": "2025-03-30",
    "backersRewards": "168895",
    "flashBonus": "40000",
    "rewardAPY": "40.64",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "9",
    "name": "30 Devs in 30 Days Campaign",
    "description": "## Overview\n\nThis initiative is designed to onboard 30 top-tier AI and Web3 developers from around the world in just 30 days, establishing a strong foundation of contributors focused on protocol enhancements, integrations, and tooling. OpenxAIDAO will allocate a substantial portion of its R&D treasury to reward and incentivize newly onboarded developers.\n\n## Scope of Work\n- Conduct targeted recruitment across AI/Web3 communities\n- Onboard 30 AI/Web3 developers in 30 days\n- Provide technical onboarding sessions and mentorship\n- Assign high-impact projects for protocol enhancement\n- Allocate stablecoins and treasury tokens as incentives\n- Enable developer showcases and governance participation\n- Track contributions and ensure accountability\n- Align with long-term ecosystem goals",
    "fundingGoal": "10000",
    "deadline": "2025-04-15",
    "backersRewards": "333663",
    "flashBonus": "80000",
    "rewardAPY": "36.67",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "10",
    "name": "Upgrade OpenxAI Infrastructure",
    "description": "## Overview\n\nA major infrastructure upgrade to enhance network scalability, security, and decentralization. This milestone includes expanding compute power, integrating high-performance GPUs & native Web3 primitives, optimizing AI model execution, and deploying advanced observability tools. The focus is on seamless multi-cloud and bare-metal deployments, improved AI processing efficiency, and expanding AI model accessibility across blockchain ecosystems.\n\n## Scope of Work\n- Deploy high-performance AI workloads across multiple infrastructure providers\n- Enable multi-cloud and bare-metal deployment capabilities\n- Integrate decentralized storage solutions (OpenmeshCloud, IPFS)\n- Expand AI model execution on decentralized infrastructure\n- Develop direct AI model deployment to EVM and non-EVM chains\n- Launch SuperView observability protocol for logs and benchmarking\n- Expand Web3 wrappers for smart contract integration\n- Enable AI model monetization via ERC-1155\n- Integrate with Chainlink CCIP for cross-chain communication\n- Launch first version of OpenxAI's AI Marketplace\n- Conduct stress testing and performance optimization",
    "fundingGoal": "75000",
    "deadline": "2025-06-20",
    "backersRewards": "2500000",
    "flashBonus": "600000",
    "rewardAPY": "35.20",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "11",
    "name": "Multi-Chain Community Governance Setup",
    "description": "## Overview\n\nA major upgrade to OpenxAI's infrastructure will enable AI agents to be deployed across both EVM-compatible and non-EVM chains. Since most Layer 1 (L1) chains operate within isolated ecosystems, establishing cross-chain governance is crucial for seamless participation and decision-making.\n\nThis initiative empowers community members to engage in OpenxAI's governance without requiring token purchases. Through multi-chain governance integration, stakeholders can vote and submit proposals across multiple blockchain ecosystems, ensuring decentralized and resilient decision-making.\n\n## Scope of Work\n- Implement multi-chain governance support (Ethereum, Solana, BNB Chain, etc.)\n- Develop bridging mechanisms for seamless governance token transfers\n- Deploy community proposal submission & voting contracts on multiple chains\n- Conduct a targeted airdrop to incentivize governance participation",
    "fundingGoal": "5000",
    "deadline": "2025-05-31",
    "backersRewards": "166831",
    "flashBonus": "40000",
    "rewardAPY": "33.40",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "12",
    "name": "First OpenxAI Competition",
    "description": "## Overview\n\nA global competition to drive AI innovation and adoption within OpenxAI by attracting developers, AI researchers, and Web3 enthusiasts to build AI-powered applications, tools, and integrations. This event will serve as a launchpad for cutting-edge AI solutions within the OpenxAI ecosystem, demonstrating real-world use cases in decentralized AI, Web3, and smart contract automation.\n\n## Challenge Themes\n- Decentralized AI Workforce (DAIW) – Build an AI-powered gig economy where specialized AI agents replace human freelancers\n- AI-Powered Crypto Expert – Develop an AI-driven crypto research assistant for analyzing live blockchain data\n- Smart Contract Vulnerability Bot – Create a real-time AI-powered security bot for scanning smart contracts\n\n## Scope of Work\n- Organize hybrid competition with both in-person and online participation\n- Secure venues in strategic global locations\n- Develop online competition portal for submissions and leaderboards\n- Provide comprehensive documentation and API access\n- Distribute rewards across winning teams\n- Offer post-hackathon funding opportunities",
    "fundingGoal": "50000",
    "deadline": "2025-08-31",
    "backersRewards": "1666310",
    "flashBonus": "400000",
    "rewardAPY": "32.50",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "13",
    "name": "Open-Source Contributions & 25,000 Developers ecosystem milestone",
    "description": "## Overview\n\nThis initiative aims to expand OpenxAI's developer ecosystem to 25,000+ active contributors, solidifying it as the premier hub for open-source decentralized AI innovation. By fostering a strong developer community, OpenxAI will accelerate the advancement of decentralized AI, protocol integrations, and infrastructure enhancements.\n\nDevelopers will contribute to key engineering milestones, including multi-cloud AI deployment, decentralized storage, Web3-native AI execution, AI model monetization, and cross-chain AI interoperability. OpenxAI will provide SDKs, open-source tools, and incentives to empower contributors in building the next generation of decentralized AI applications.\n\n## Scope of Work\n- Aggregate the most powerful open source AI models and integrate into OpenxAI Studio\n- Deploy and configure Xnode-powered compute clusters\n- Set up decentralized storage infrastructure\n- Develop automated resource allocation algorithms\n- Implement security protocols and failover mechanisms\n- Conduct performance benchmarking and stress testing\n- Optimize GPU-based AI execution pipelines",
    "fundingGoal": "20000",
    "deadline": "2025-08-31",
    "backersRewards": "716862",
    "flashBonus": "160000",
    "rewardAPY": "31.50",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "14",
    "name": "Launch OpenxAI Model Marketplace. First 100 AI models listed",
    "description": "## Overview\n\nThe OpenxAI Model Marketplace is a decentralized platform for AI models, AI training datasets, AI agents, and AI-powered services, enabling developers, researchers, and enterprises to list, trade, and deploy AI assets without centralized control. This milestone will establish the first 100 AI models, training datasets, and AI agents, laying the foundation for a transparent, composable, and accessible AI economy.\n\n## Scope of Work\n- Develop core marketplace infrastructure for listing, trading, and monetizing AI models\n- Create smart contracts for AI model ownership and licensing using ERC standards\n- Implement on-chain metadata storage and provenance tracking\n- Launch with first 100 AI models and training datasets\n- Establish quality verification mechanisms through peer reviews\n- Enable composable AI models for DApp integration\n- Implement data verification and privacy mechanisms\n- Deploy AI agents that can perform autonomous tasks\n- Design user-friendly marketplace interface\n- Conduct security audits and testing",
    "fundingGoal": "25000",
    "deadline": "2025-09-30",
    "backersRewards": "782559",
    "flashBonus": "200000",
    "rewardAPY": "19.78",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "15",
    "name": "Verified Contributor v2, Reputation System Beta",
    "description": "## Overview\n\nThe OpenxAI Governance Upgrade & OpenR&D v2 introduces enhanced decentralized governance mechanisms and an upgraded research development framework, increasing efficient decision-making, verifiable contributor accountability, and an optimized innovation pipeline.\n\nThis milestone will establish improved DAO voting systems, contributor reputation tracking, decentralized grant funding, and structured OpenR&D participation, enabling OpenxAI to scale research efforts, attract top AI contributors, and ensure governance remains trustless, transparent, and community-driven.\n\n## Scope of Work\n- Develop advanced DAO voting mechanisms with reputation-weighted governance\n- Implement governance staking models for voting rights and proposals\n- Establish structured R&D tracks for protocol advancements\n- Integrate Verified Contributor v2 reputation system\n- Implement decentralized reputation tracking\n- Establish treasury management framework\n- Enable community-led proposal funding\n- Conduct security audits for governance systems",
    "fundingGoal": "15000",
    "deadline": "2025-07-31",
    "backersRewards": "463343",
    "flashBonus": "120000",
    "rewardAPY": "16.89",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "16",
    "name": "AI-as-a-Service Goes Live",
    "description": "## Overview\n\nThe launch of AI-as-a-Service (AIaaS) on OpenxAI marks a historic breakthrough in decentralized AI, allowing OpenxAI developed AI services to be accessed by external users, businesses, and Web3 protocols—either for free or through a fee-based model. This milestone transforms OpenxAI into a fully operational AI infrastructure provider, where AI models, AI agents, and AI-powered automation services can be seamlessly integrated into smart contracts, decentralized applications (dApps), and enterprise systems.\n\n## Scope of Work\n- Deploy AI services on community-governed infrastructure\n- Enable permissionless AI model execution via APIs and smart contracts\n- Implement multi-cloud and decentralized compute infrastructure\n- Deploy programmable AI agents for autonomous tasks\n- Provide enterprise-grade AI services integration\n- Develop plug-and-play AI integrations for blockchain networks\n- Enable cross-chain AI interoperability\n- Implement revenue collection mechanisms for the DAO\n- Establish free and fee-based service tiers\n- Conduct comprehensive security audits",
    "fundingGoal": "30000",
    "deadline": "2025-08-31",
    "backersRewards": "914303",
    "flashBonus": "240000",
    "rewardAPY": "14.13",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "17",
    "name": "OpenxAI Marketplace Expansion",
    "description": "## Overview\n\nThe expansion of the OpenxAI Marketplace marks the next phase in decentralized AI adoption, building upon the foundation established in the initial launch. This milestone focuses on scaling AI model listings, increasing AI training dataset availability, onboarding more AI agents, and integrating additional AI-powered services into the marketplace.\n\n## Scope of Work\n- Scale AI model listings and service offerings\n- Implement DAO-controlled AI service pricing\n- Enable reputation-based marketplace curation\n- Expand AI ownership tokenization mechanisms\n- Enhance cross-chain AI model deployment\n- Integrate Chainlink CCIP for interoperability\n- Enable AI-powered smart contracts\n- Expand decentralized hosting infrastructure\n- Implement on-chain verifiable AI testing\n- Develop real-time public dashboards",
    "fundingGoal": "30000",
    "deadline": "2025-12-31",
    "backersRewards": "901919",
    "flashBonus": "240000",
    "rewardAPY": "11.51",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "18",
    "name": "OpenxAI Day - Global Summit",
    "description": "## Overview\n\nOpenxAI Day is a dedicated global summit designed to bring together top thought leaders, engineers, researchers, and innovators in AI, blockchain, and open-source technology. This event will serve as a platform for shaping the future of decentralized AI, fostering collaboration, and advocating for a transparent, open, and democratized AI ecosystem.\n\n## Mission & Objectives\n- Educate – Raise awareness about the importance of open, decentralized AI and the risks of AI monopolization\n- Unite – Connect leading AI developers, blockchain pioneers, entrepreneurs, and policymakers\n- Innovate – Showcase the latest breakthroughs in decentralized AI infrastructure\n- Advocate – Push for ethical AI development and fair governance models\n\n## Scope of Work\n- Organize summit in NYC or San Francisco for 500 high-impact attendees\n- Coordinate speakers, workshops, and technical demonstrations\n- Facilitate networking and collaboration opportunities\n- Document and share event outcomes and insights\n- Launch post-event initiatives and partnerships",
    "fundingGoal": "50000",
    "deadline": "2025-10-31",
    "backersRewards": "1482559",
    "flashBonus": "400000",
    "rewardAPY": "9.00",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "19",
    "name": "Second OpenxAI Competition",
    "description": "## Overview\n\nBuilding on the success of the first OpenxAI Competition, this second global competition will further drive AI innovation and adoption within the OpenxAI ecosystem. The event will focus on advanced use cases, enterprise integration, and scaling decentralized AI solutions across multiple industries.\n\n## Scope of Work\n- Organize expanded competition with increased prize pool\n- Develop advanced challenge tracks for enterprise and scaling solutions\n- Coordinate global participation and mentorship programs\n- Facilitate industry partnerships and integration opportunities\n- Provide comprehensive technical documentation and support\n- Enable seamless deployment of winning solutions\n- Establish long-term collaboration frameworks",
    "fundingGoal": "50000",
    "deadline": "2025-12-31",
    "backersRewards": "1461919",
    "flashBonus": "400000",
    "rewardAPY": "6.60",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "20",
    "name": "1M Open-Source Contributions & 100,000 Developers ecosystem milestone",
    "description": "## Overview\n\nThis milestone represents a massive expansion of the OpenxAI open-source ecosystem, reaching 1 million open-source contributions and 100,000 active developers worldwide. By fostering a permissionless, decentralized, and highly competitive AI development environment, OpenxAI will establish itself as the leading hub for decentralized AI innovation, infrastructure, and governance.\n\n## Scope of Work\n- Scale open-source AI contributions to reach 1 million contributions\n- Grow developer ecosystem to 100,000+ active participants\n- Enable collaborative AI model training and research\n- Establish research grants and AI innovation challenges\n- Integrate advanced reputation tracking systems\n- Implement decentralized peer reviews and audits\n- Launch specialized AI development programs\n- Provide comprehensive developer tooling and SDKs\n- Create public leaderboards and recognition systems\n- Deploy long-term sustainability incentives",
    "fundingGoal": "25000",
    "deadline": "2025-11-30",
    "backersRewards": "720639",
    "flashBonus": "200000",
    "rewardAPY": "4.31",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  },
  {
    "id": "21",
    "name": "Final Token Distribution & DAO Hand-Off",
    "description": "## Overview\n\nThe Final Token Distribution & DAO Hand-Off marks the completion of OpenxAI's transition to a fully decentralized, community-governed AI ecosystem. This milestone finalizes the distribution of all remaining OPENX tokens, ensuring that governance, incentives, and decision-making authority are entirely in the hands of the OpenxAI DAO and its contributors.\n\n## Scope of Work\n- Distribute all remaining OPENX tokens to contributors, stakers, AI developers, and governance participants\n- Implement final reputation-based adjustments for governance power weighting\n- Establish final governance framework for DAO-controlled protocol modifications\n- Complete transition of all infrastructure to DAO-controlled multisig wallets\n- Ensure all treasury assets and funding reserves are fully DAO-managed\n- Implement trustless upgrade paths for future protocol changes\n- Conduct comprehensive security audits of DAO-controlled contracts\n- Optimize DAO governance UX for seamless community participation",
    "fundingGoal": "2000",
    "deadline": "2025-12-31",
    "backersRewards": "56837",
    "flashBonus": "16000",
    "rewardAPY": "2.14",
    "status": "Pending",
    "escrow": "0xF1f3393e65D443cC261bD0263Fe90386A5bA7647"
  }
]
